# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Funções e seus Parâmetros
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS:   H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

* Vejamos um exemplo com o código ~a25-troca.c~

#+attr_latex: :options fontsize=\scriptsize
#+BEGIN_SRC C :tangle e/a25-troca.c
#include <stdio.h>
void troca (int x, int y) {
  int temp;
  temp = x;
  x = y;
  y = temp;
  return;
}
int main() {
  int a, b;
  a = 5;
  b = 10;
  printf("#1: a = %d, b = %d\n", a, b);
  troca(a, b);
  printf("#2: a = %d, b = %d\n", a, b);
  return 0;
}
#+END_SRC

O que é impresso em #2?

#+latex: \pause

#+begin_src shell :results output :exports both :dir e
gcc a25-troca.c; ./a.out
#+end_src

#+RESULTS:
: #1 a = 5, b = 10
: #2 a = 5, b = 10

